fourat153/embedded_projects/pic18f6420_device_driver/MCAL_LAYER/Interrupt/mcal_interrupt_internal.h
/* 
 * File:   mcal_interrupt_internal.h
 * Author: mm77
 *
 * Created on July 18, 2023, 2:38 PM
 */

#ifndef MCAL_INTERRUPT_INTERNAL_H
#define	MCAL_INTERRUPT_INTERNAL_H
/*************includes***************/
#include "mcal_interrupt_cfg.h"
/*****macros***************/
/****************function macros*****************/ 
/*same in all module internal */
#if ADC_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the adc module*/
#define ADC_InterruptDisable()         (PIE1bits.ADIE  = 0 )
/*sets the interrupt enable for the adc module*/ 
#define ADC_InterruptEnable()          (PIE1bits.ADIE  = 1)
/*clear the interrupt flag for the adc module*/
#define ADC_InterruptFlagClear()       (PIR1bits.ADIF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the adc module interrupt priority to be high priority level*/
#define ADC_HighPrioritySet()          (IPR1bits.ADIP  = 1 )
/*this routine activate the adc module interrupt priority to be low priority level*/
#define ADC_LowPrioritySet()           ( IPR1bits.ADIP  = 0 )  
#endif 
#endif 

#if TIMER0_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the TIMER0 module*/
#define TIMER0_InterruptDisable()         (INTCONbits.TMR0IE  = 0 )
/*sets the interrupt enable for the TIMER0 module*/ 
#define TIMER0_InterruptEnable()          (INTCONbits.TMR0IE  = 1)
/*clear the interrupt flag for the TIMER0 module*/
#define TIMER0_InterruptFlagClear()       (INTCONbits.TMR0IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the TIMER0 module interrupt priority to be high priority level*/
#define TIMER0_HighPrioritySet()          (INTCON2bits.TMR0IP  = 1 )
/*this routine activate the TIMER0 module interrupt priority to be low priority level*/
#define TIMER0_LowPrioritySet()           ( INTCON2bits.TMR0IP  = 0 )  
#endif 
#endif 

#if TIMER1_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the TIMER1 module*/
#define TIMER1_InterruptDisable()         (PIE1bits.TMR1IE = 0 )
/*sets the interrupt enable for the TIMER1 module*/ 
#define TIMER1_InterruptEnable()          (PIE1bits.TMR1IE = 1)
/*clear the interrupt flag for the TIMER1 module*/
#define TIMER1_InterruptFlagClear()       (PIR1bits.TMR1IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the TIMER1 module interrupt priority to be high priority level*/
#define TIMER1_HighPrioritySet()          (IPR1bits.TMR1IP  = 1 )
/*this routine activate the TIMER1 module interrupt priority to be low priority level*/
#define TIMER1_LowPrioritySet()           ( IPR1bits.TMR1IP  = 0 )  
#endif 
#endif 



#if TIMER2_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the TIMER2 module*/
#define TIMER2_InterruptDisable()         (PIE1bits.TMR2IE = 0 )
/*sets the interrupt enable for the TIMER2 module*/ 
#define TIMER2_InterruptEnable()          (PIE1bits.TMR2IE = 1)
/*clear the interrupt flag for the TIMER2 module*/
#define TIMER2_InterruptFlagClear()       (PIR1bits.TMR2IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the TIMER2 module interrupt priority to be high priority level*/
#define TIMER2_HighPrioritySet()          (IPR1bits.TMR2IP  = 1 )
/*this routine activate the TIMER2 module interrupt priority to be low priority level*/
#define TIMER2_LowPrioritySet()           ( IPR1bits.TMR2IP  = 0 )  
#endif 
#endif

#if TIMER3_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the TIMER3 module*/
#define TIMER3_InterruptDisable()         (PIE2bits.TMR3IE = 0 )
/*sets the interrupt enable for the TIMER3 module*/ 
#define TIMER3_InterruptEnable()          (PIE2bits.TMR3IE = 1)
/*clear the interrupt flag for the TIMER3 module*/
#define TIMER3_InterruptFlagClear()       (PIR2bits .TMR3IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the TIMER3 module interrupt priority to be high priority level*/
#define TIMER3_HighPrioritySet()          (IPR2bits.TMR3IP  = 1 )
/*this routine activate the TIMER3 module interrupt priority to be low priority level*/
#define TIMER3_LowPrioritySet()           ( IPR2bits.TMR3IP   = 0 )  
#endif 
#endif 

#if CCP1_INTERRUPT_FEATURE_ENBALE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the CCP1 module*/
#define CCP1_InterruptDisable()         (PIE1bits.CCP1IE = 0 )
/*sets the interrupt enable for the CCP1 module*/ 
#define CCP1_InterruptEnable()          (PIE1bits.CCP1IE = 1)
/*clear the interrupt flag for the CCP1 module*/
#define CCP1_InterruptFlagClear()       (PIR1bits .CCP1IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the CCP1 module interrupt priority to be high priority level*/
#define CCP1_HighPrioritySet()          (IPR1bits.CCP1IP  = 1 )
/*this routine activate the CCP1 module interrupt priority to be low priority level*/
#define CCP1_LowPrioritySet()           ( IPR1bits.CCP1IP   = 0 )  
#endif 
#endif 

#if CCP2_INTERRUPT_FEATURE_ENBALE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the CCP2 module*/
#define CCP2_InterruptDisable()         (PIE2bits.CCP2IE = 0 )
/*sets the interrupt enable for the CCP2 module*/ 
#define CCP2_InterruptEnable()          (PIE2bits.CCP2IE = 1)
/*clear the interrupt flag for the CCP2 module*/
#define CCP2_InterruptFlagClear()       (PIR2bits .CCP2IF =  0)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the CCP2 module interrupt priority to be high priority level*/
#define CCP2_HighPrioritySet()          (IPR2bits.CCP2IP  = 1 )
/*this routine activate the CCP2 module interrupt priority to be low priority level*/
#define CCP2_LowPrioritySet()           ( IPR2bits.CCP2IP   = 0 )  
#endif 
#endif 

#if USART_TX_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the USART_TX module*/
#define USART_TX_InterruptDisable()         (PIE1bits.TXIE  = 0 )
/*sets the interrupt enable for the USART_TX module*/ 
#define USART_TX_InterruptEnable()          (PIE1bits.TXIE  = 1)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the USART_TX module interrupt priority to be high priority level*/
#define USART_TX_HighPrioritySet()          (IPR1bits.TXIP  = 1 )
/*this routine activate the USART_TX module interrupt priority to be low priority level*/
#define USART_TX_LowPrioritySet()           ( IPR1bits.TXIP  = 0 )  
#endif 
#endif 


#if USART_RX_INTERRUPT_FEATURE_ENABLE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the USART_RX module*/
#define USART_RX_InterruptDisable()         (PIE1bits.RCIE  = 0 )
/*sets the interrupt enable for the USART_RX module*/ 
#define USART_RX_InterruptEnable()          (PIE1bits.RCIE  = 1)
#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the USART_RX module interrupt priority to be high priority level*/
#define USART_RX_HighPrioritySet()          (IPR1bits.RCIP  = 1 )
/*this routine activate the USART_RX module interrupt priority to be low priority level*/
#define USART_RX_LowPrioritySet()           ( IPR1bits.RCIP  = 0 )  
#endif 
#endif 

#if MSSP_I2C_INTERRUPT_FEATURE_ENBALE == INTERRUPT_FEATURE_ENABLE 
 /*clear the interrupt enable for the MSSP module*/
#define MSSP_I2C_InterruptDisable()                 (PIE1bits.SSPIE  = 0 )
#define MSSP_I2C_BUS_COL_InterruptDisable()         (PIE2bits.BCLIE  = 0 )
/*sets the interrupt enable for the MSSP module*/ 
#define MSSP_I2C_InterruptEnable()                 (PIE1bits.SSPIE  = 1)
#define MSSP_I2C_BUS_COL_InterruptEnable()         (PIE2bits.BCLIE  = 1 )

/*clear the interrupt flag for the MSSP module*/
#define MSSP_I2C_InterruptFlagClear()               (PIR1bits.SSPIF =  0)
#define MSSP_I2C_BUS_COL_InterruptFlagClear()       (PIR2bits.BCLIF  = 0)

#if INTERRUPT_PRIORITY_LEVELS_ENABLE   == INTERRUPT_FEATURE_ENABLE 
/*this routine activate the MSSP_I2C module interrupt priority to be high priority level*/
#define MSSP_I2C_HighPrioritySet()                  (IPR1bits.SSPIP  = 1 )
#define MSSP_I2C_BUS_COL_HighPrioritySet()          (IPR2bits.BCLIP  = 1 )

/*this routine activate the MSSP_I2C module interrupt priority to be low priority level*/
#define MSSP_I2C_LowPrioritySet()                   ( IPR1bits.SSPIP  = 0 ) 
#define MSSP_I2C_BUS_COL_lowPrioritySet()           (IPR2bits.BCLIP  = 0 )

#endif 
#endif 

/*user define data types */
/*function prototypes*/


#endif	/* MCAL_INTERRUPT_INTERNAL_H */

